<a href="https://colab.research.google.com/github/chinnuzz/python/blob/main/Data_frames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **1.CREATING A DATAFRAME USING DIFFERENT METHODS**

The Pandas DataFrame is a structure that contains two-dimensional data and its corresponding labels. DataFrames are widely used in data science, machine learning, scientific computing, and many other data-intensive fields.Dataframe contains the folowing:

*   Data organized in two dimensions, rows and columns
*   Labels that correspond to the rows and columns

We can create data frame in different ways.

 ***a)with columns name only  and then adding rows using loc[] method***

In [ ]:
import pandas as pd
df = pd.DataFrame(columns = ['Building','Roomno','Capacity'])
df

Empty DataFrame
Columns: [Building, Roomno, Capacity]
Index: []

In [ ]:
# Add records to dataframe
df.loc[0] = ["Georgopol",866,150]
df.loc[1] = ["Mylta",732,100]
df.loc[2] = ["Novorepnoye",129,70]
df.loc[3] = ["Pochinki",604,200]
df.loc[4] = ["Primorsk",444,50]
df.loc[5] = ["Severny",521,130]
df

      Building Roomno Capacity
0    Georgopol    866      150
1        Mylta    732      100
2  Novorepnoye    129       70
3     Pochinki    604      200
4     Primorsk    444       50
5      Severny    521      130

 ***b)Initialize a blank dataframe and keep adding***

In [ ]:
import pandas as pd
df = pd.DataFrame()  
print (df)  

df['Building'] = ['Georgopol',  'Mylta','Novorepnoye','Pochinki','Primorsk','Severny']
df['Roomno'] = [866,732,129,604,444,521]
df['Capacity'] = [150,100,70,200,50,130]
df

Empty DataFrame
Columns: []
Index: []

      Building  Roomno  Capacity
0    Georgopol     866       150
1        Mylta     732       100
2  Novorepnoye     129        70
3     Pochinki     604       200
4     Primorsk     444        50
5      Severny     521       130

***c)with columns name only  and then appending rows one by one to it using append() method***

In [ ]:
import pandas as pd
# create an Empty DataFrame object With column names only
df = pd.DataFrame(columns = ['Building', 'Roomno', 'Capacity'])
print(df)
# append rows to an empty DataFrame
df = df.append({'Building':'Georgopol','Roomno':866,'Capacity':150},ignore_index = True)
df = df.append({'Building':'Mylta','Roomno':732,'Capacity':100},ignore_index = True)
df = df.append({'Building':'Novorepnoye','Roomno':129,'Capacity':70},ignore_index = True)
df = df.append({'Building':'Pochinki','Roomno':604,'Capacity':200},ignore_index = True)
df = df.append({'Building':'Primorsk','Roomno':444,'Capacity':50},ignore_index = True)
df = df.append({'Building':'Severny','Roomno':521,'Capacity':130},ignore_index = True)
df

Empty DataFrame
Columns: [Building, Roomno, Capacity]
Index: []

      Building Roomno Capacity
0    Georgopol    866      150
1        Mylta    732      100
2  Novorepnoye    129       70
3     Pochinki    604      200
4     Primorsk    444       50
5      Severny    521      130

 ***d)Using numpy array in the DataFrame constructor***

In [ ]:
#Pass a 2D numpy array - each row is the corresponding row required in the dataframe
import pandas as pd
import numpy as np
data = np.array([["Georgopol",866,150], 
                 ["Mylta",732,100], 
                 ["Novorepnoye",129,70], 
                 ["Pochinki",604,200],
                 ["Primorsk",444,50],
                  ["Severny",521,130]])
  # pass column names in the columns parameter                
df = pd.DataFrame(data, columns = ['Building', 'Roomno','Capacity']) 

df

      Building Roomno Capacity
0    Georgopol    866      150
1        Mylta    732      100
2  Novorepnoye    129       70
3     Pochinki    604      200
4     Primorsk    444       50
5      Severny    521      130

***e) Create DataFrame using List with index and column names.***

In [ ]:
import pandas as pd
# list of strings
lst = ['Georgopol',  'Mylta','Novorepnoye','Pochinki','Primorsk','Severny']
# Calling DataFrame constructor on list  with indices and columns specified
df = pd.DataFrame(lst, index =[866,732,129,604,444,521],columns =['Building'])
df

        Building
866    Georgopol
732        Mylta
129  Novorepnoye
604     Pochinki
444     Primorsk
521      Severny

***f)Create DataFrame using multi-dimensional list***

In [ ]:
import pandas as pd 
lst = [['Georgopol',866,150], ['Mylta',732,100],['Novorepnoye',129,70],
       ['Pochinki',604,200],['Primorsk',444,50],['Severny',521,130]]
df = pd.DataFrame(lst, columns =['Building', 'Roomno','Capacity'])
df

      Building  Roomno  Capacity
0    Georgopol     866       150
1        Mylta     732       100
2  Novorepnoye     129        70
3     Pochinki     604       200
4     Primorsk     444        50
5      Severny     521       130

***g)using dictionary in the DataFrame constructor***

In [ ]:
# Dictionary Keys become Column names in the dataframe
# Dictionary values become the vaues of columns 
# Column values are combined in a single row according to the order in which they are specified
import pandas as pd
data = {'Building': ["Georgopol","Mylta","Novorepnoye","Pochinki","Primorsk","Severny"], 
        'Roomno': [866,732,129,604,444,521],
        'Capacity':[150,100,70,200,50,130]
       }
# pass column names in the columns parameter 
df = pd.DataFrame(data) 
df

      Building  Roomno  Capacity
0    Georgopol     866       150
1        Mylta     732       100
2  Novorepnoye     129        70
3     Pochinki     604       200
4     Primorsk     444        50
5      Severny     521       130

***h)using list of dictionaries in the DataFrame constructor***

In [ ]:
# Each dictionary is a record
# Dictionary Keys become Column names in the dataframe
# Dictionary values become the vaues of columns

import pandas as pd
data = [{'Building': "Georgopol", 'Roomno': 866, 'Capacity':150}, 
        {'Building': "Mylta", 'Roomno': 732, 'Capacity':100}, 
        {'Building': "Novorepnoye", 'Roomno': 129, 'Capacity':70}, 
        {'Building': "Pochinki", 'Roomno': 604 ,'Capacity':200},
        {'Building': "Primorsk", 'Roomno': 444 ,'Capacity':50},
        {'Building': "Severny", 'Roomno': 521 ,'Capacity':130}
       ]
# pass column names in the columns parameter 
df = pd.DataFrame(data) 

df

      Building  Roomno  Capacity
0    Georgopol     866       150
1        Mylta     732       100
2  Novorepnoye     129        70
3     Pochinki     604       200
4     Primorsk     444        50
5      Severny     521       130

***i)using dictionary in the from_dict method***

In [ ]:
# Dictionary Keys become Column names in the dataframe
# Dictionary values become the vaues of columns 
# Column values are combined in a single row according to the order in which they are specified
import pandas as pd
data = {'Building': ["Georgopol","Mylta","Novorepnoye","Pochinki","Primorsk","Severny"], 
        'Roomno': [866,732,129,604,444,521],
        'Capacity':[150,100,70,200,50,130]
       }
# pass column names in the columns parameter 
df = pd.DataFrame.from_dict(data) 

df

      Building  Roomno  Capacity
0    Georgopol     866       150
1        Mylta     732       100
2  Novorepnoye     129        70
3     Pochinki     604       200
4     Primorsk     444        50
5      Severny     521       130

In [ ]:
# Now what if the column names we used above need to be indexes - like a transpose of the earlier data
# Specify orient = "index" and pass column names for the columns generated after the transpose
df = pd.DataFrame.from_dict(data, orient='index',columns=['record1', 'record2', 'record3', 'record4','record5','record6']) 

df

            record1 record2      record3   record4   record5  record6
Building  Georgopol   Mylta  Novorepnoye  Pochinki  Primorsk  Severny
Roomno          866     732          129       604       444      521
Capacity        150     100           70       200        50      130

***j) from Dictionary with required columns only***

In [ ]:
import pandas as pd
data = {'Building': ["Georgopol","Mylta","Novorepnoye","Pochinki","Primorsk","Severny"], 
        'Roomno': [866,732,129,604,444,521],
        'Capacity':[150,100,70,200,50,130]
       }
# creating a Dataframe object 
df = pd.DataFrame(data,index = ['a', 'b','c','d','e','f'],columns = ['Building', 'Capacity'])
df

      Building  Capacity
a    Georgopol       150
b        Mylta       100
c  Novorepnoye        70
d     Pochinki       200
e     Primorsk        50
f      Severny       130

***k) from dictionary with key and simple value***

In [ ]:
import pandas as pd
# dictionary
details = {
    'Georgopol' : 866,
    'Pochinki' : 604,
    'Severny' : 521,
    'Mylta' :732
    }
#creating a Dataframe object from a list of tuples of key, value pair
df = pd.DataFrame(list(details.items()))  
df

           0    1
0  Georgopol  866
1   Pochinki  604
2    Severny  521
3      Mylta  732

***l)from nested Dictionary.***

In [ ]:
import pandas as pd
# dictionary with dictionary object in values i.e. nested dictionary
details = { 
    0 : {
        'Building':'Georgopol',
         'Roomno':866,
         'Capacity':150
        },
    1 : {
       'Building':'Mylta',
       'Roomno':732,
       'Capacity':100
        },
    2 : {
        'Building':'Novorepnoye',
         'Roomno':129,
         'Capacity':70
        },
    3:  {
        'Building':'Pochinki',
         'Roomno':604,
         'Capacity':200
        },
    4:  {
        'Building':'Primorsk',
         'Roomno':444,
         'Capacity':50
        },
    5:  {
        'Building':'Severny',
         'Roomno':521,
         'Capacity':130
         },
}
  
# creating a Dataframe object from nested dictionaryin which inside dictionary key is act as index valueand column value is 0, 1, 2...
df = pd.DataFrame(details)
# swap the columns with indexes
df = df.transpose()
df

      Building Roomno Capacity
0    Georgopol    866      150
1        Mylta    732      100
2  Novorepnoye    129       70
3     Pochinki    604      200
4     Primorsk    444       50
5      Severny    521      130

***m)copying an existing dataframe***

In [ ]:
df1 = df.head(4).copy()
df1

      Building Roomno Capacity
0    Georgopol    866      150
1        Mylta    732      100
2  Novorepnoye    129       70
3     Pochinki    604      200

## **2.CREATE DATAFRAME FROM CSV FILE AND SAVE AS CSV FILE**

***a)Load data from local drive***

In [ ]:
import pandas as pd

from google.colab import files
uploaded = files.upload()

Saving weapon_status.csv to weapon_status.csv

In [ ]:
import io
weapon_df = pd.read_csv(io.BytesIO(uploaded['weapon_status.csv']))
weapon_df.head(5)

   Weapon Name    Weapon Type  Bullet Type  ...  HDMG_1  HDMG_2  HDMG_3
0        Groza  Assault Rifle         7.62  ...    80.6    69.0    51.8
1          AKM  Assault Rifle         7.62  ...    80.6    69.0    51.8
2         M762  Assault Rifle         7.62  ...    77.3    66.2    49.7
3  MK47 Mutant  Assault Rifle         7.62  ...    80.6    69.0    51.8
4       AUG A3  Assault Rifle         5.56  ...    70.7    60.6    45.4

[5 rows x 20 columns]

***b)From Github***

In [ ]:
path= 'https://github.com/chinnuzz/python/raw/main/weapon_status.csv'
weaponstat_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, )
weaponstat_df.head(7)

   Weapon Name    Weapon Type  Bullet Type  ...  HDMG_1  HDMG_2  HDMG_3
0        Groza  Assault Rifle         7.62  ...    80.6    69.0    51.8
1          AKM  Assault Rifle         7.62  ...    80.6    69.0    51.8
2         M762  Assault Rifle         7.62  ...    77.3    66.2    49.7
3  MK47 Mutant  Assault Rifle         7.62  ...    80.6    69.0    51.8
4       AUG A3  Assault Rifle         5.56  ...    70.7    60.6    45.4
5       SCAR-L  Assault Rifle         5.56  ...    70.7    60.6    45.4
6         M416  Assault Rifle         5.56  ...    70.7    60.6    45.4

[7 rows x 20 columns]

***c) Mount from drive***

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
weapon_df = pd.read_csv("/content/drive/MyDrive/weapon_stat.csv")
weapon_df.describe

<bound method NDFrame.describe of     Weapon Name              Weapon Type  Bullet Type  ...  HDMG_1  HDMG_2  HDMG_3
0         Groza            Assault Rifle         7.62  ...    80.6    69.0    51.8
1           AKM            Assault Rifle         7.62  ...    80.6    69.0    51.8
2          M762            Assault Rifle         7.62  ...    77.3    66.2    49.7
3   MK47 Mutant            Assault Rifle         7.62  ...    80.6    69.0    51.8
4        AUG A3            Assault Rifle         5.56  ...    70.7    60.6    45.4
5        SCAR-L            Assault Rifle         5.56  ...    70.7    60.6    45.4
6          M416            Assault Rifle         5.56  ...    70.7    60.6    45.4
7         M16A4            Assault Rifle         5.56  ...    70.7    60.6    45.4
8          G36C            Assault Rifle         5.56  ...    70.7    60.6    45.4
9           OBZ            Assault Rifle         5.56  ...    70.7    60.6    45.4
10         M249        Light Machine Gun         5.56  ...    72.4    62.0    46.5
11        DP-28        Light Machine Gun         7.62  ...    82.1    70.3    52.7
12       Vector           Submachine Gun         9.00  ...    39.0    33.4    25.1
13          Uzi           Submachine Gun         9.00  ...    32.7    28.0    21.0
14     PP-Bizon           Submachine Gun         9.00  ...    44.0    37.8    28.3
15         MP5K           Submachine Gun         9.00  ...    41.5    35.6    26.7
16     Thompson           Submachine Gun         0.45  ...    50.4    43.1    32.4
17        UMP45           Submachine Gun         0.45  ...    49.1    42.1    31.5
18         S686                  Shotgun        12.00  ...   218.7   187.2   140.4
19        S1897                  Shotgun        12.00  ...   215.1   184.5   137.7
20         S12K                  Shotgun        12.00  ...   131.4   112.5    84.6
21         MK14  Designed Marksman Rifle         7.62  ...   100.3    86.0    64.5
22          SLR  Designed Marksman Rifle         7.62  ...    95.4    81.7    61.3
23          SKS  Designed Marksman Rifle         7.62  ...    87.1    74.7    56.0
24          QBU  Designed Marksman Rifle         5.56  ...    78.9    67.6    50.7
25       Mini14  Designed Marksman Rifle         5.56  ...    75.6    64.8    48.6
26          VSS  Designed Marksman Rifle         9.00  ...    67.4    57.8    43.3
27          AWM             Sniper Rifle         0.30  ...   183.7   157.5   118.1
28          M24             Sniper Rifle         7.62  ...   138.0   118.0    89.0
29        Kar98             Sniper Rifle         7.62  ...   138.2   118.5    88.8
30        Win94             Sniper Rifle         0.45  ...   115.4    99.0    74.2
31    Sawed-Off                   Pistol        12.00  ...   167.2   143.2   107.2
32        R1895                   Pistol         7.62  ...    76.7    65.7    49.3
33          R45                   Pistol         0.45  ...    76.7    65.7    49.3
34        P1911                   Pistol         0.45  ...    56.8    48.7    36.5
35          P92                   Pistol         9.00  ...    48.4    41.4    31.1
36         P18C                   Pistol         9.00  ...    31.4    26.9    20.2
37     Skorpion                   Pistol         9.00  ...     NaN     NaN     NaN
38     Crossbow                    Other          NaN  ...     NaN     NaN     NaN
39          Pan                    Melee          NaN  ...     NaN     NaN     NaN
40      Crowbar                    Melee          NaN  ...     NaN     NaN     NaN
41       Sickle                    Melee          NaN  ...     NaN     NaN     NaN
42      Machete                    Melee          NaN  ...     NaN     NaN     NaN
43        Punch                    Melee          NaN  ...     NaN     NaN     NaN

[44 rows x 20 columns]>

***Save Dataframe as CSV file using to_csv() method***

In [ ]:
data = {'Name':['Mortal','Kaztro','Viper','Caesar'],
        'Id':[6729,5719,6911,2689],
        'Place':['Mylta','Pochinki','Georgopol','Severny']}
df = pd.DataFrame(data)
df.to_csv('my_dataset.csv')

## **3.GROUP BY OPERATIONS IN DATAFRAME**

A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups.

***a)Splitting to groups***

In [ ]:
import pandas as pd 
df = pd.read_csv('https://github.com/chinnuzz/python/raw/main/weapon_status.csv')
weapon_range = df.groupby('Range')
# Let's print the first entries in all the groups formed.
weapon_range.first()

       Weapon Name              Weapon Type  ...  HDMG_2  HDMG_3
Range                                        ...
25.0          S686                  Shotgun  ...   187.2   140.4
50.0        Vector           Submachine Gun  ...    33.4    25.1
60.0      Skorpion                   Pistol  ...     NaN     NaN
200.0          Uzi           Submachine Gun  ...    28.0    21.0
300.0     PP-Bizon           Submachine Gun  ...    37.8    28.3
400.0        Groza            Assault Rifle  ...    69.0    51.8
500.0  MK47 Mutant            Assault Rifle  ...    69.0    51.8
600.0       AUG A3            Assault Rifle  ...    60.6    45.4
700.0       Mini14  Designed Marksman Rifle  ...    64.8    48.6
800.0         MK14  Designed Marksman Rifle  ...    86.0    64.5
900.0          AWM             Sniper Rifle  ...   157.5   118.1

[11 rows x 19 columns]

In [ ]:
weapon_range.last()

      Weapon Name              Weapon Type  Bullet Type  ...  HDMG_1  HDMG_2  HDMG_3
Range                                                    ...
25.0         P18C                   Pistol         9.00  ...    31.4    26.9    20.2
50.0       Vector           Submachine Gun         9.00  ...    39.0    33.4    25.1
60.0     Skorpion                   Pistol         9.00  ...     NaN     NaN     NaN
200.0    Thompson           Submachine Gun         0.45  ...    50.4    43.1    32.4
300.0       UMP45           Submachine Gun         0.45  ...    49.1    42.1    31.5
400.0        M249        Light Machine Gun         5.56  ...    72.4    62.0    46.5
500.0         VSS  Designed Marksman Rifle         9.00  ...    67.4    57.8    43.3
600.0       Win94             Sniper Rifle         0.45  ...   115.4    99.0    74.2
700.0      Mini14  Designed Marksman Rifle         5.56  ...    75.6    64.8    48.6
800.0       Kar98             Sniper Rifle         7.62  ...   138.2   118.5    88.8
900.0         AWM             Sniper Rifle         0.30  ...   183.7   157.5   118.1

[11 rows x 19 columns]

***b)Select a Group***

In [ ]:
weapon_range.get_group(400).head(5)

   Weapon Name        Weapon Type  Bullet Type  ...  HDMG_1  HDMG_2  HDMG_3
0        Groza      Assault Rifle         7.62  ...    80.6    69.0    51.8
1          AKM      Assault Rifle         7.62  ...    80.6    69.0    51.8
2         M762      Assault Rifle         7.62  ...    77.3    66.2    49.7
10        M249  Light Machine Gun         5.56  ...    72.4    62.0    46.5

[4 rows x 19 columns]

***c)ngroups***


it returns number of groups

In [ ]:
weapon_range.ngroups

11

***d)groups***


it returns groupwise row number

In [ ]:
weapon_range.groups

{25.0: [18, 19, 20, 31, 32, 33, 34, 35, 36], 50.0: [12], 60.0: [37], 200.0: [13, 15, 16], 300.0: [14, 17], 400.0: [0, 1, 2, 10], 500.0: [3, 26], 600.0: [4, 5, 6, 7, 8, 9, 11, 30], 700.0: [25], 800.0: [21, 22, 23, 24, 28, 29], 900.0: [27]}

***e)size()***

In [ ]:
weapon_range.size()

Range
25.0     9
50.0     1
60.0     1
200.0    3
300.0    2
400.0    4
500.0    2
600.0    8
700.0    1
800.0    6
900.0    1
dtype: int64

## **4.COMBINING AND MERGING DATASETS**

***a) Concatenating DataFrame***

*1.using concat() only*

In [ ]:
#to concat a dataframe, we use .concat() function .this function concat a dataframe and returns a new dataframe.
import pandas as pd
data1 = {'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [866,732,129],
        'Capacity': [150,100,70]
       }
# Define dictionary 

data2 = {'Building': ["Pochinki","Primorsk","Severny"], 
        'Roomno': [8604,444,521],
        'Capacity': [200,50,130]
       }

# Convert the dictionarys into DataFrames  
df1= pd.DataFrame(data1,index=[0, 1, 2])
df2 = pd.DataFrame(data2,index=[3, 4, 5])
frames = [df1, df2]
df3 = pd.concat(frames)
df3

      Building  Roomno  Capacity
0    Georgopol     866       150
1        Mylta     732       100
2  Novorepnoye     129        70
3     Pochinki    8604       200
4     Primorsk     444        50
5      Severny     521       130

*2.Setting axis along with concat() to get intersection of dataframe*

In [ ]:
# set axes join = inner   to get the intersection of dataframe
data3 = {'Name':['Mortal','Kaztro','Viper','Caesar'],
        'Id':[6729,5719,6911,2689],
        'Place':['Mylta','Pochinki','Georgopol','Severny']}
df4 = pd.DataFrame(data3,index=[1, 3, 4,5]) 
#set axes join = inner for intersection of dataframe
df5 = pd.concat([df3, df4], axis=1, join='inner')
df5

   Building  Roomno  Capacity    Name    Id      Place
1     Mylta     732       100  Mortal  6729      Mylta
3  Pochinki    8604       200  Kaztro  5719   Pochinki
4  Primorsk     444        50   Viper  6911  Georgopol
5   Severny     521       130  Caesar  2689    Severny

***b) Merging DataFrame***

Merging two dataset can be done in dataframes with common column name and with different column name

*1.Merge Two DataFrames on a Key*

In [ ]:
import pandas as pd
left = pd.DataFrame({'id':[1,2,3],
        'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [866,732,129],
        'Capacity': [150,100,70]
       })
right = pd.DataFrame({'id':[1,2,3],
        'Name':['Mortal','Kaztro','Viper'],
        'pId':[6729,5719,6911],
        'Place':['Mylta','Pochinki','Georgopol']}
   )
pd.merge(left,right,on='id')

   id     Building  Roomno  Capacity    Name   pId      Place
0   1    Georgopol     866       150  Mortal  6729      Mylta
1   2        Mylta     732       100  Kaztro  5719   Pochinki
2   3  Novorepnoye     129        70   Viper  6911  Georgopol

*2.Merge Two DataFrames on Multiple Keys*

In [ ]:
import pandas as pd
left = pd.DataFrame({'id':[1,2,3],
        'Building': ["Georgopol","Pochinki","Novorepnoye"], 
        'Roomno': [866,732,129],
        'Capacity': [150,100,70]
       })
right = pd.DataFrame({'id':[1,2,3],
        'Name':['Mortal','Kaztro','Viper'],
        'pId':[6729,5719,6911],
        'Building':['Mylta','Pochinki','Georgopol']}
   )

pd.merge(left,right,on=['id','Building'])

   id  Building  Roomno  Capacity    Name   pId
0   2  Pochinki     732       100  Kaztro  5719

*3.Merge Using 'how' Argument*

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4],
   'Name': ['Mortal', 'Kaztro', 'Ceasor','Blaster'],
    'Building':['Pochinki','Mylta','Georgopol','Mill']})
right = pd.DataFrame(
   {'id':[1,2,3,4],
   'Name': ['Viper', 'Nie Ambro', 'Gyan Sujan','Rai'],
   'Building':['Mylta','Pochinki','Georgopol','Mill']})


#left join
pd.merge(left, right, on='Building', how='left')

   id_x   Name_x   Building  id_y      Name_y
0     1   Mortal   Pochinki     2   Nie Ambro
1     2   Kaztro      Mylta     1       Viper
2     3   Ceasor  Georgopol     3  Gyan Sujan
3     4  Blaster       Mill     4         Rai

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4],
   'Name': ['Mortal', 'Kaztro', 'Ceasor','Blaster'],
    'Building':['Pochinki','Mylta','Georgopol','Mill']})
right = pd.DataFrame(
   {'id':[1,2,3,4],
   'Name': ['Viper', 'Nie Ambro', 'Gyan Sujan','Rai'],
   'Building':['Mylta','Pochinki','Georgopol','Mill']})

#right join
pd.merge(left, right, on='Building', how='right')

   id_x   Name_x   Building  id_y      Name_y
0     2   Kaztro      Mylta     1       Viper
1     1   Mortal   Pochinki     2   Nie Ambro
2     3   Ceasor  Georgopol     3  Gyan Sujan
3     4  Blaster       Mill     4         Rai

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4],
   'Name': ['Mortal', 'Kaztro', 'Ceasor','Blaster'],
    'Building':['Pochinki','Mylta','Georgopol','Mill']})
right = pd.DataFrame(
   {'id':[1,2,3,4],
   'Name': ['Viper', 'Nie Ambro', 'Gyan Sujan','Rai'],
   'Building':['Mylta','Pochinki','Georgopol','Mill']})

#inner join
pd.merge(left, right, on='Building', how='inner')

   id_x   Name_x   Building  id_y      Name_y
0     1   Mortal   Pochinki     2   Nie Ambro
1     2   Kaztro      Mylta     1       Viper
2     3   Ceasor  Georgopol     3  Gyan Sujan
3     4  Blaster       Mill     4         Rai

***c)Join***

Both join and merge can be used to combines two dataframes but the join method combines two dataframes on the basis of their indexes whereas the merge method is more versatile and allows us to specify columns beside the index to join on for both dataframes.

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4],
   'Name': ['Mortal', 'Kaztro', 'Ceasor','Blaster'],
    'Building':['Pochinki','Mylta','Georgopol','Mill']})
right = pd.DataFrame(
   {'id':[1,2,3,4],
   'Name': ['Viper', 'Nie Ambro', 'Gyan Sujan','Rai'],
   'Building':['Mylta','Pochinki','Georgopol','Mill']})

left.join(right,lsuffix = '_l',rsuffix = '_r')

   id_l   Name_l Building_l  id_r      Name_r Building_r
0     1   Mortal   Pochinki     1       Viper      Mylta
1     2   Kaztro      Mylta     2   Nie Ambro   Pochinki
2     3   Ceasor  Georgopol     3  Gyan Sujan  Georgopol
3     4  Blaster       Mill     4         Rai       Mill

## **5.TYPES  OF INDEXING IN DATA FRAME**


Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame.Indexing can also be known as Subset Selection

***1)  Indexing a Dataframe using indexing operator [] :***

In [ ]:
# retrieving columns by indexing operator
first = weapon_range["Weapon Name"]
first.head(5)

0           Groza
1             AKM
2            M762
3     MK47 Mutant
4          AUG A3
5          SCAR-L
6            M416
7           M16A4
8            G36C
10           M249
12         Vector
13            Uzi
14       PP-Bizon
15           MP5K
16       Thompson
17          UMP45
18           S686
19          S1897
20           S12K
21           MK14
22            SLR
23            SKS
24            QBU
25         Mini14
26            VSS
27            AWM
28            M24
31      Sawed-Off
32          R1895
37       Skorpion
38       Crossbow
39            Pan
40        Crowbar
41         Sickle
42        Machete
Name: Weapon Name, dtype: object

In [ ]:
#In order to select multiple columns, we have to pass a list of columns in an indexing operator.
first = weapon_range["Weapon Name","Weapon Type"]
first.head(7)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

    Weapon Name              Weapon Type
0         Groza            Assault Rifle
1           AKM            Assault Rifle
2          M762            Assault Rifle
3   MK47 Mutant            Assault Rifle
4        AUG A3            Assault Rifle
5        SCAR-L            Assault Rifle
6          M416            Assault Rifle
7         M16A4            Assault Rifle
8          G36C            Assault Rifle
9           OBZ            Assault Rifle
10         M249        Light Machine Gun
11        DP-28        Light Machine Gun
12       Vector           Submachine Gun
13          Uzi           Submachine Gun
14     PP-Bizon           Submachine Gun
15         MP5K           Submachine Gun
16     Thompson           Submachine Gun
17        UMP45           Submachine Gun
18         S686                  Shotgun
19        S1897                  Shotgun
20         S12K                  Shotgun
21         MK14  Designed Marksman Rifle
22          SLR  Designed Marksman Rifle
23          SKS  Designed Marksman Rifle
24          QBU  Designed Marksman Rifle
25       Mini14  Designed Marksman Rifle
26          VSS  Designed Marksman Rifle
27          AWM             Sniper Rifle
28          M24             Sniper Rifle
29        Kar98             Sniper Rifle
31    Sawed-Off                   Pistol
32        R1895                   Pistol
33          R45                   Pistol
34        P1911                   Pistol
37     Skorpion                   Pistol
38     Crossbow                    Other
39          Pan                    Melee
40      Crowbar                    Melee
41       Sickle                    Melee
42      Machete                    Melee
43        Punch                    Melee

***2) indexing a DataFrame using .loc[ ] :***

In [ ]:
#In order to select a single row using .loc[], we put a single row label in a .loc function.
path='https://github.com/chinnuzz/python/raw/main/weapon_status.csv'
weapon_d = pd.read_csv(path,sep = ',', header = 'infer',index_col ="Weapon Name", usecols = ['Weapon Name','Weapon Type','Range','Damage'])
first = weapon_d.loc["AKM"]
second = weapon_d.loc["Groza"]
print(first,"\n-----------------------------\n",second)

Weapon Type    Assault Rifle
Damage                    49
Range                    400
Name: AKM, dtype: object
-----------------------------
 Weapon Type    Assault Rifle
Damage                    49
Range                    400
Name: Groza, dtype: object

In [ ]:
#In order to select multiple rows, we put all the row labels in a list and pass that to .loc function.
# retrieving multiple rows by loc method
first = weapon_d.loc[["AKM", "Groza"]]
print(first)

               Weapon Type  Damage  Range
Weapon Name
AKM          Assault Rifle      49  400.0
Groza        Assault Rifle      49  400.0

In [ ]:
# retrieving all rows and some columns by loc method
first = weapon_d.loc[:, ["Range","Damage"]]
first.head(5)

             Range  Damage
Weapon Name
Groza        400.0      49
AKM          400.0      49
M762         400.0      47
MK47 Mutant  500.0      49
AUG A3       600.0      43

***3)  Indexing a DataFrame using .iloc[ ] :***

In [ ]:
#Selecting a single row
now =weapon_d.iloc[3] 
print(now)

Weapon Type    Assault Rifle
Damage                    49
Range                    500
Name: MK47 Mutant, dtype: object

In [ ]:
#Selecting multiple 
now= weapon_d.iloc [[3, 5, 7]]
now

               Weapon Type  Damage  Range
Weapon Name
MK47 Mutant  Assault Rifle      49  500.0
SCAR-L       Assault Rifle      43  600.0
M16A4        Assault Rifle      43  600.0

In [ ]:
#Selecting all the rows and a some columns
now = weapon_d.iloc [:, [1, 2]]
now.head(5)

             Damage  Range
Weapon Name
Groza            49  400.0
AKM              49  400.0
M762             47  400.0
MK47 Mutant      49  500.0
AUG A3           43  600.0

## **6.AGGREGATION FUNCTION IN DATA FRAME**


Pandas provides some aggregate functions to do some operations on grouped dataframe. Some commonly used aggregation functions are

***1) mean()***

In [ ]:
#Pandas groupby: mean()
#The aggregate function mean() computes mean values for each group. Here, pandas groupby followed by mean will compute mean population for each continent.
path='https://github.com/chinnuzz/python/raw/main/weapon_status.csv'
weapon_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols =['Weapon Name','Range','Damage','Bullet Speed'])
weapon_df.groupby("Range").mean().head(3)

       Damage  Bullet Speed
Range
25.0    111.0         345.0
50.0     31.0         300.0
60.0     22.0         400.0


***2) sum()***

The aggregating function sum() simply adds of values within each group.

In [ ]:
weapon_df.groupby("Range").sum().head(3)

       Damage  Bullet Speed
Range
25.0      999        2415.0
50.0       31         300.0
60.0       22         400.0

***3) size***

The aggregating function size() computes the size per each group.

In [ ]:
weapon_df.groupby("Range").size()

Range
25.0     9
50.0     1
60.0     1
200.0    3
300.0    2
400.0    4
500.0    2
600.0    8
700.0    1
800.0    6
900.0    1
dtype: int64

***4) count()***

The aggregating function count() computes the number of values with in each group.

In [ ]:
weapon_df.groupby("Range").count()

       Weapon Name  Damage  Bullet Speed
Range
25.0             9       9             7
50.0             1       1             1
60.0             1       1             1
200.0            3       3             3
300.0            2       2             2
400.0            4       4             4
500.0            2       2             2
600.0            8       8             8
700.0            1       1             1
800.0            6       6             6
900.0            1       1             1

***5) std()***

The aggregating function std() computes standard deviation of the values within each group.

In [ ]:
weapon_df.groupby("Range").std()

          Damage  Bullet Speed
Range
25.0   84.196199     45.184806
50.0         NaN           NaN
60.0         NaN           NaN
200.0   7.000000     36.055513
300.0   2.828427     35.355339
400.0   1.914854    100.860878
500.0   5.656854    293.449314
600.0   8.219098     80.175589
700.0        NaN           NaN
800.0  12.425780     33.146141
900.0        NaN           NaN

***6) var()***

The aggregating function var() computes variance, an estimate of variability, for each column per group.

In [ ]:
weapon_df.groupby("Range").var()

            Damage  Bullet Speed
Range
25.0   7089.000000   2041.666667
50.0           NaN           NaN
60.0           NaN           NaN
200.0    49.000000   1300.000000
300.0     8.000000   1250.000000
400.0     3.666667  10172.916667
500.0    32.000000  86112.500000
600.0    67.553571   6428.125000
700.0          NaN           NaN
800.0   154.400000   1098.666667
900.0          NaN           NaN

***7) describe()***

The aggregating function describe() computes a quick summary of values per group. It computes the number of values, mean, std, the minimum value, maximum value and value at multiple percentiles.

In [ ]:
weapon_df.groupby("Range").describe()

      Damage                             ... Bullet Speed
       count     mean        std    min  ...          25%    50%     75%    max
Range                                    ...
25.0     9.0  111.000  84.196199   23.0  ...       340.00  360.0  372.50  380.0
50.0     1.0   31.000        NaN   31.0  ...       300.00  300.0  300.00  300.0
60.0     1.0   22.000        NaN   22.0  ...       400.00  400.0  400.00  400.0
200.0    3.0   33.000   7.000000   26.0  ...       305.00  330.0  340.00  350.0
300.0    2.0   37.000   2.828427   35.0  ...       262.50  275.0  287.50  300.0
400.0    4.0   47.500   1.914854   45.0  ...       713.75  715.0  765.00  915.0
500.0    2.0   45.000   5.656854   41.0  ...       403.75  507.5  611.25  715.0
600.0    8.0   46.875   8.219098   43.0  ...       838.75  880.0  882.50  900.0
700.0    1.0   46.000        NaN   46.0  ...       990.00  990.0  990.00  990.0
800.0    6.0   62.000  12.425780   48.0  ...       792.50  800.0  826.25  853.0
900.0    1.0  105.000        NaN  105.0  ...       910.00  910.0  910.00  910.0

[11 rows x 16 columns]

***8) groupby :n()***

The aggregating function nth(), gives nth value, in each group.

In [ ]:
path='https://github.com/chinnuzz/python/raw/main/weapon_status.csv'
weapon_df2 = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols =['Weapon Name','Weapon Type','Range','Damage','Bullet Speed'])
weapon_df2.groupby("Weapon Type").nth(6)

              Weapon Name  Damage  Range  Bullet Speed
Weapon Type
Assault Rifle        M416      43  600.0         890.0
Pistol           Skorpion      22   60.0         400.0

***9) min() and max()***

min() and max() function are used to get minimum and maximum value per group respectively.

In [ ]:
weapon_df2.groupby("Weapon Type").min().head(3)

                        Weapon Name  Damage  Range  Bullet Speed
Weapon Type
Assault Rifle                   AKM      43  400.0         710.0
Designed Marksman Rifle        MK14      41  500.0         300.0
Light Machine Gun             DP-28      45  400.0         715.0

In [ ]:
weapon_df2.groupby("Weapon Type").max().head(3)

                        Weapon Name  Damage  Range  Bullet Speed
Weapon Type
Assault Rifle                SCAR-L      49  600.0         900.0
Designed Marksman Rifle         VSS      61  800.0         990.0
Light Machine Gun              M249      51  600.0         915.0

## **7. APPENDING ROWS AND COLUMNS TO THE DATA FRAME**


dataframe.append() function is used to append rows of other dataframe to the end of the given dataframe, returning a new dataframe object. Columns not in the original dataframes are added as new columns and the new cells are populated with NaN value.

***1) appending one dataframe to another***

In [ ]:
# Creating the first Dataframe using dictionary
import pandas as pd

df1 = pd.DataFrame({'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [8662,7392,1529],
        'Capacity': [150,100,70]
       })
# Creating the Second Dataframe using dictionary

df2 = pd.DataFrame({'Building': ["Pochinki","Primorsk","Severny"], 
        'Roomno': [8604,4844,5231],
        'Capacity': [200,50,130]
       })
## to append df2 at the end of df1 dataframe
df1.append(df2)
df1

      Building  Roomno  Capacity
0    Georgopol    8662       150
1        Mylta    7392       100
2  Novorepnoye    1529        70

***2) appending one dataframe to another with index value ignored***

In [ ]:
df1.append(df2, ignore_index = True)
df1

      Building  Roomno  Capacity
0    Georgopol    8662       150
1        Mylta    7392       100
2  Novorepnoye    1529        70

***3) Append dataframe of different shape***

In [ ]:
left = pd.DataFrame({'id':[1,2,3],
        'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [866,732,129]})
right = pd.DataFrame({'id':[1,2,3],
        'Name':['Mortal','Kaztro','Viper'],
        'pId':[6729,5719,6911]})
left.append(right, ignore_index = True)
# the new cells are populated with NaN values.

   id     Building  Roomno    Name     pId
0   1    Georgopol   866.0     NaN     NaN
1   2        Mylta   732.0     NaN     NaN
2   3  Novorepnoye   129.0     NaN     NaN
3   1          NaN     NaN  Mortal  6729.0
4   2          NaN     NaN  Kaztro  5719.0
5   3          NaN     NaN   Viper  6911.0

***4) Add a single row using DataFrame.loc***

In [ ]:
import pandas as pd
from numpy.random import randint
dict = {'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [866,732,129]}
df = pd.DataFrame(dict)
df.loc[len(df.index)] = ['Severny',238] 
display(df)

      Building  Roomno
0    Georgopol     866
1        Mylta     732
2  Novorepnoye     129
3      Severny     238

***5) Adding new column to existing DataFrame  by declaring a new list as a column***

In [ ]:
import pandas as pd
# Define a dictionary 
dict = {'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [866,732,129]}
# Convert the dictionary into DataFrame
df = pd.DataFrame(dict)
# Declare a list that is to be converted into a column
Name= ['Mortal','Kaztro','Viper']
# Using 'Address' as the column name and equating it to the list
df['Name'] = Name
df

      Building  Roomno    Name
0    Georgopol     866  Mortal
1        Mylta     732  Kaztro
2  Novorepnoye     129   Viper

***6) Adding new column to existing DataFrame using DataFrame.insert()***

It gives the freedom to add a column at any position we like and not just at the end. It also provides different options for inserting the column values

In [ ]:
df.insert(2, "Rating", ['G','G','PG'], True)
df

      Building  Roomno Rating    Name
0    Georgopol     866      G  Mortal
1        Mylta     732      G  Kaztro
2  Novorepnoye     129     PG   Viper

***6)  Adding new column to existing DataFrame using  Dataframe.assign() method***
This method will create a new dataframe with new column added to the old dataframe.

In [ ]:

import pandas as pd
data = {'Building': ["Georgopol","Mylta","Novorepnoye"], 
        'Roomno': [866,732,129]}
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
# Using 'Name' as the column name and equating it to the list
df2 = df.assign(Name= ['Mortal','Kaztro','Viper'])
# Observe the result
df2

      Building  Roomno    Name
0    Georgopol     866  Mortal
1        Mylta     732  Kaztro
2  Novorepnoye     129   Viper

***7) Adding new column to existing DataFrame using Dictionary***

We can use a Python dictionary to add a new column in pandas DataFrame. Use an existing column as the key values and their respective values will be the values for new column.

In [ ]:
import pandas as pd
data1 = {'Building': ["Georgopol","Mylta","Novorepnoye"]}
# Define a dictionary with key values of an existing column and their respective value pairs as the # values for our new column.
# Convert the dictionary into DataFrame
Name= {'Mortal':'Georgopol','Kaztro':'Mylta','Viper':'Novorepnoye'}
df = pd.DataFrame(data1)
df['Name'] = Name
df

      Building    Name
0    Georgopol  Mortal
1        Mylta  Kaztro
2  Novorepnoye   Viper

## **8. PIVOTING OPERATIONS WITH DATA FRAME**

The pivot() function is used to reshaped a given DataFrame organized by given index / column values.
***1) pivot()***

In [ ]:
weapon_df2.pivot(index ='Weapon Name',columns = 'Weapon Type',values = 'Range' ).head(5)

Weapon Type  Assault Rifle  ...  Submachine Gun
Weapon Name                 ...
AKM                  400.0  ...             NaN
AUG A3               600.0  ...             NaN
AWM                    NaN  ...             NaN
Crossbow               NaN  ...             NaN
Crowbar                NaN  ...             NaN

[5 rows x 9 columns]

***2) pivot_table()***

It Creates a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

In [ ]:
df2 = pd.pivot_table(data = weapon_df2,index ='Weapon Name',columns = 'Weapon Type',values = 'Damage' )
df2.sample()

Weapon Type  Assault Rifle  ...  Submachine Gun
Weapon Name                 ...
SKS                    NaN  ...             NaN

[1 rows x 9 columns]

## **9.DIFFERENT POSSIBLE OPERATIONS TO A DATA FRAME**


some more methods which are useful for dataframe operations are

***1) Slicing of rows***

We can perform slicing operations to get the desired number of rows from within a given range. With the help of slicing, we can perform various operations only on the specific subset of the data

In [ ]:
# slicing the number of rows 
df1 = weapon_df[10:15]
df1

   Weapon Name  Damage  Range  Bullet Speed
10        M249      45  400.0         915.0
11       DP-28      51  600.0         715.0
12      Vector      31   50.0         300.0
13         Uzi      26  200.0         350.0
14    PP-Bizon      35  300.0         300.0

***2) Selecting specific columns***

To select a particular column or to select number of columns from the dataframe for further processing of data.

In [ ]:
df2 = weapon_df2.loc[:, ['Weapon Name','Weapon Type']]
df2.head(5)

   Weapon Name    Weapon Type
0        Groza  Assault Rifle
1          AKM  Assault Rifle
2         M762  Assault Rifle
3  MK47 Mutant  Assault Rifle
4       AUG A3  Assault Rifle

***3) Summarize the data***

In order to get insights from data, we must have a statistical summary of data. To display a statistical summary of the data such as mean, median, mode, std etc.

In [ ]:
weapon_df.describe()

           Damage       Range  Bullet Speed
count   44.000000   38.000000     36.000000
mean    63.340909  403.552632    615.777778
std     47.134613  297.886492    256.455077
min     18.000000   25.000000    250.000000
25%     41.000000   52.500000    350.000000
50%     48.500000  400.000000    715.000000
75%     60.250000  600.000000    859.750000
max    216.000000  900.000000    990.000000

***4) Sort data with respect to a column***

In [ ]:
weapon_df2.sort_values(by ='Bullet Speed').head()

   Weapon Name              Weapon Type  Damage  Range  Bullet Speed
17       UMP45           Submachine Gun      39  300.0         250.0
34       P1911                   Pistol      41   25.0         250.0
16    Thompson           Submachine Gun      40  200.0         280.0
26         VSS  Designed Marksman Rifle      41  500.0         300.0
14    PP-Bizon           Submachine Gun      35  300.0         300.0

***5) Display mean of each column***

In [ ]:
weapon_df.mean()

Damage           63.340909
Range           403.552632
Bullet Speed    615.777778
dtype: float64

***6) transpose( ) to to convert dataframe's index to column and columns to index***

In [ ]:
df.transpose()

                  0       1            2
Building  Georgopol   Mylta  Novorepnoye
Name         Mortal  Kaztro        Viper

## **10. STRING MANIPULATIONS**

String manipulation is the process of changing, parsing, splicing, pasting, or analyzing strings

In [ ]:
# python script for create a dataframe for string manipulations
import pandas as pd
import numpy as np
  
df = pd.Series(['Computer Science', ' Mathematics', ' Chemistry','Physics'])
df

0    Computer Science
1         Mathematics
2           Chemistry
3             Physics
dtype: object

***1) lower()***

Converts all uppercase characters in strings in the DataFrame to lower case and returns the lowercase strings in the result.

In [ ]:
df.str.lower()

0    computer science
1         mathematics
2           chemistry
3             physics
dtype: object

***2) upper()***

Converts all lowercase characters in strings in the DataFrame to upper case and returns the uppercase strings in result.

In [ ]:
df.str.upper()

0    COMPUTER SCIENCE
1         MATHEMATICS
2           CHEMISTRY
3             PHYSICS
dtype: object

***3) strip()***

If there are spaces at the beginning or end of a string, we should trim the strings to eliminate spaces using strip() or remove the extra spaces contained by a string in DataFrame

In [ ]:

df
print('\nAfter using the strip:')
df.str.strip()

After using the strip:

0    Computer Science
1         Mathematics
2           Chemistry
3             Physics
dtype: object

***4) split(‘ ‘)***

Splits each string with the given pattern. Strings are split and the new elements after the performed split operation, are stored in a list.

In [ ]:
# split(pattern)
print(df)
print('\nAfter using the strip:')
print(df.str.split(','))
  
# now we can use [] or get() to fetch 
# the index values
print('\nusing []:')
print(df.str.split(',').str[0])
  
print('\nusing get():')
print(df.str.split(',').str.get(1))

0    Computer Science
1         Mathematics
2           Chemistry
3             Physics
dtype: object

After using the strip:
0    [Computer Science]
1        [ Mathematics]
2          [ Chemistry]
3             [Physics]
dtype: object

using []:
0    Computer Science
1         Mathematics
2           Chemistry
3             Physics
dtype: object

using get():
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

***5) len()***

With the help of len() we can compute the length of each string in DataFrame & if there is empty data in DataFrame, it returns NaN.

In [ ]:
print("length of the dataframe: ", len(df))
print("length of each value of dataframe:")
df.str.len()

length of the dataframe:  4
length of each value of dataframe:

0    16
1    12
2    10
3     7
dtype: int64

***6) cat(sep=’ ‘)**9

It concatenates the data-frame index elements or each string in DataFrame with given separator.

In [ ]:

print(df)
  
print("\nafter using cat:")
print(df.str.cat(sep='_'))
  
print("\nworking with NaN using cat:")
print(df.str.cat(sep='_', na_rep='#'))

0    Computer Science
1         Mathematics
2           Chemistry
3             Physics
dtype: object

after using cat:
Computer Science_ Mathematics_ Chemistry_Physics

working with NaN using cat:
Computer Science_ Mathematics_ Chemistry_Physics

***7) repeat(value)***

It repeats each element with a given number of times like below in example, there are two appearances of each string in DataFrame.

In [ ]:
df.str.repeat(2)

0    Computer ScienceComputer Science
1             Mathematics Mathematics
2                 Chemistry Chemistry
3                      PhysicsPhysics
dtype: object

***8) count(pattern)***

It returns the count of the appearance of pattern in each element in Data-Frame like below in example it counts ‘n’ in each string of DataFrame and returns the total counts of ‘n’ in each string.

In [ ]:
print(df.str.count('o'))

0    1
1    0
2    0
3    0
dtype: int64

***9) isupper() and isnumeric()***

isupper() checks whether all characters in each string in the Index of the Data-Frame in upper case or not, and returns a Boolean value.isnumeric() checks whether all characters in each string in the Index of the Data-Frame are numeric or not, and returns a Boolean value.

In [ ]:
print(df.str.isupper()) 
print("\n-----------\n")
print(df.str.isnumeric())

0    False
1    False
2    False
3    False
dtype: bool

-----------

0    False
1    False
2    False
3    False
dtype: bool

***10)swapcase()***
It swaps the case lower to upper and vice-versa

In [91]:

df.str.swapcase()

0    cOMPUTER sCIENCE
1         mATHEMATICS
2           cHEMISTRY
3             pHYSICS
dtype: object

***11) find(pattern) and findall(pattern)***

find(pattern)returns first position of the first occurrence of the pattern.findall(pattern) returns a list of all occurrences of the pattern

In [92]:

# find(pattern) in result '-1' indicates there is no value matching with given pattern in particular row
print(df.str.find('n'))
print("\n-----------\n")
# findall(pattern) in result [] indicates null list as  there is no value matching with given pattern in particular row
print(df.str.findall('n'))

0    13
1    -1
2    -1
3    -1
dtype: int64

-----------

0    [n]
1     []
2     []
3     []
dtype: object